Postsecondary enrolments, by program type, credential type, Classification of Instructional Programs, Primary Grouping (CIP_PG), registration status and sex

In [83]:
# Dependencies and Setup
import pandas as pd
%matplotlib notebook
import numpy as np
import seaborn
from scipy import stats 
# Hide warning messages in notebook
import warnings
warnings.filterwarnings('ignore')
# File to Load (Remember to Change These)
file_to_load = "37100011.csv"
# Read Purchasing File and store into Pandas data frame
education_data = pd.read_csv(file_to_load, low_memory=False)
education_data.head()

,REF_DATE,GEO,DGUID,Institution type,Program type,Credential type,"Classification of Instructional Programs, Primary Grouping (CIP_PG)",Registration status,Sex,UOM,UOM_ID,SCALAR_FACTOR,SCALAR_ID,VECTOR,COORDINATE,VALUE,STATUS,SYMBOL,TERMINATED,DECIMALS
0,1992/1993,Canada,2016A000011124,"Total, institution type","Total, program type","Total, credential type","Total, instructional programs","Total, registration status","Total, sex",Number,223,units,0,v79464902,1.1.1.1.1.1.1,1355451.0,NaN,NaN,NaN,0
1,1992/1993,Canada,2016A000011124,"Total, institution type","Total, program type","Total, credential type","Total, instructional programs","Total, registration status",Males,Number,223,units,0,v79464903,1.1.1.1.1.1.2,608616.0,NaN,NaN,NaN,0
2,1992/1993,Canada,2016A000011124,"Total, institution type","Total, program type","Total, credential type","Total, instructional programs","Total, registration status",Females,Number,223,units,0,v79464904,1.1.1.1.1.1.3,746838.0,NaN,NaN,NaN,0
3,1992/1993,Canada,2016A000011124,"Total, institution type","Total, program type","Total, credential type","Total, instructional programs","Total, registration status",Sex unknown,Number,223,units,0,v79464905,1.1.1.1.1.1.4,NaN,..,NaN,NaN,0
4,1992/1993,Canada,2016A000011124,"Total, institution type","Total, program type","Total, credential type","Total, instructional programs",Full-time student,"Total, sex",Number,223,units,0,v79464906,1.1.1.1.1.2.1,934176.0,NaN,NaN,NaN,0

In [84]:
#Clean up data, drop columns not required and filter only canada
education_data2 = education_data.drop(columns=["DGUID","DECIMALS", "TERMINATED", "SYMBOL", "STATUS","COORDINATE", "VECTOR", "SCALAR_ID", "SCALAR_FACTOR", "UOM_ID", "UOM","Program type"])
geo_group_tech2 = education_data2[education_data2["Classification of Instructional Programs, Primary Grouping (CIP_PG)"] == "Mathematics, computer and information sciences [7]"]
geo_group_tech3 = geo_group_tech2.drop(columns=["Classification of Instructional Programs, Primary Grouping (CIP_PG)"])
#filter Canada only
geo_group_tech_Canada = geo_group_tech3[geo_group_tech3.GEO == "Canada"]
#geo_group_tech_Canada.to_csv("Output.csv")
#Clean up rows
geo_group_tech_Canada = geo_group_tech_Canada[geo_group_tech_Canada["Institution type"].str.contains("Total,")==False]
geo_group_tech_Canada = geo_group_tech_Canada[geo_group_tech_Canada["Credential type"].str.contains("Total,")==False]
geo_group_tech_Canada = geo_group_tech_Canada[geo_group_tech_Canada["Registration status"].str.contains("Total,")==False]
geo_group_tech_Canada = geo_group_tech_Canada[geo_group_tech_Canada["Sex"].str.contains("Total,")==False]
geo_group_tech_Canada = geo_group_tech_Canada[geo_group_tech_Canada["Sex"].str.contains("Sex unknown")==False]
geo_group_tech_Canada.head()

,REF_DATE,GEO,Institution type,Credential type,Registration status,Sex,VALUE
10182,1992/1993,Canada,University,Certificate,Full-time student,Males,240.0
10183,1992/1993,Canada,University,Certificate,Full-time student,Females,126.0
10185,1992/1993,Canada,University,Certificate,Part-time student,Males,1878.0
10186,1992/1993,Canada,University,Certificate,Part-time student,Females,1308.0
10328,1992/1993,Canada,University,Diploma,Full-time student,Males,48.0

In [85]:
geo_group_tech_Canada2 = geo_group_tech_Canada.groupby(["REF_DATE", "Institution type"]).sum().reset_index()
geo_group_tech_Canada2.head(12)

     REF_DATE Institution type    VALUE
0   1992/1993          College  41712.0
1   1992/1993       University  63891.0
2   1993/1994          College  41634.0
3   1993/1994       University  65220.0
4   1994/1995          College  42078.0
5   1994/1995       University  64917.0
6   1995/1996          College  44172.0
7   1995/1996       University  64278.0
8   1996/1997          College  41958.0
9   1996/1997       University  65250.0
10  1997/1998          College  50364.0
11  1997/1998       University  68802.0

In [86]:
#Syntax: DataFrame.pivot(index=None, columns=None, values=None)[source]
# Minor Data Munging to Re-Format the Data Frames
geo_group_tech_Canada3 = geo_group_tech_Canada2.pivot(index ="Institution type", columns = "REF_DATE", values = "VALUE")
#geo_group_tech_Canada3.reset_index(level = None, inplace = True)
#Update columns and preview the Reformatting worked
geo_group_tech_Canada4 = geo_group_tech_Canada3.rename(columns={"1992/1993": "1993", "1993/1994": "1994","1994/1995": "1995", "1995/1996": "1996", "1996/1997": "1997", "1997/1998": "1998", "1998/1999": "1999","1999/2000": "2000", "2000/2001": "2001", "2001/2002": "2002", "2002/2003": "2003", "2003/2004": "2004","2004/2005": "2005","2005/2006": "2006","2006/2007": "2007", "2007/2008": "2008","2008/2009": "2009","2009/2010": "2010", "2010/2011": "2011", "2011/2012": "2012", "2012/2013": "2013", "2013/2014": "2014", "2014/2015": "2015", "2015/2016": "2016", "2016/2017": "2017" })
geo_group_tech_Canada4.head()

REF_DATE,1993,1994,1995,1996,1997,1998,1999,2000,2001,2002,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
Institution type,,,,,,,,,,,,,,,,,,,,,
College,41712.0,41634.0,42078.0,44172.0,41958.0,50364.0,57576.0,61194.0,74094.0,74037.0,...,34344.0,31062.0,34824.0,35307.0,35814.0,37419.0,38871.0,40800.0,40305.0,47013.0
University,63891.0,65220.0,64917.0,64278.0,65250.0,68802.0,74949.0,82755.0,79752.0,86130.0,...,63894.0,64329.0,65202.0,67278.0,70593.0,76284.0,81714.0,89712.0,97143.0,107397.0

In [87]:
geo_group_tech_Canada10Y = geo_group_tech_Canada4[["2007","2008","2009","2010","2011","2012","2013", "2014", "2015", "2016", "2017"]]
geo_group_tech_Canada10Y

REF_DATE,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
Institution type,,,,,,,,,,,
College,34701.0,34344.0,31062.0,34824.0,35307.0,35814.0,37419.0,38871.0,40800.0,40305.0,47013.0
University,66684.0,63894.0,64329.0,65202.0,67278.0,70593.0,76284.0,81714.0,89712.0,97143.0,107397.0

In [101]:
#x_axis = np.arange(0,110000,10000)
#x_axis
plt.plot(["Instituion Type"])
geo_group_tech_Canada10Y.plot(kind='line', figsize=(10,10))
plt.title("Postsecondary Enrolments, by Institution Type")
plt.xlabel("YEARS")
plt.ylabel("Postsecondary Enrolments")
plt.yticks(np.arange(10000, 100000, 10000)) 
plt.show()

NameError: name 'plt' is not defined

In [97]:
geo_group_tech_Canada_sex = geo_group_tech_Canada.groupby(["REF_DATE", "Sex"]).sum().reset_index()
geo_group_tech_Canada_sex.head()

    REF_DATE      Sex    VALUE
0  1992/1993  Females  35697.0
1  1992/1993    Males  69906.0
2  1993/1994  Females  35010.0
3  1993/1994    Males  71844.0
4  1994/1995  Females  33672.0

In [99]:
#Syntax: DataFrame.pivot(index=None, columns=None, values=None)[source]
# Minor Data Munging to Re-Format the Data Frames
geo_group_tech_Canada_sex2 = geo_group_tech_Canada_sex.pivot(index ="Sex", columns = "REF_DATE", values = "VALUE")
#geo_group_tech_Canada3.reset_index(level = None, inplace = True)
#Update columns and preview the Reformatting worked
geo_group_tech_Canada_sex2 = geo_group_tech_Canada_sex2.rename(columns={"1992/1993": "1993", "1993/1994": "1994","1994/1995": "1995", "1995/1996": "1996", "1996/1997": "1997", "1997/1998": "1998", "1998/1999": "1999","1999/2000": "2000", "2000/2001": "2001", "2001/2002": "2002", "2002/2003": "2003", "2003/2004": "2004","2004/2005": "2005","2005/2006": "2006","2006/2007": "2007", "2007/2008": "2008","2008/2009": "2009","2009/2010": "2010", "2010/2011": "2011", "2011/2012": "2012", "2012/2013": "2013", "2013/2014": "2014", "2014/2015": "2015", "2015/2016": "2016", "2016/2017": "2017" })
geo_group_tech_Canada_sex2 = geo_group_tech_Canada_sex2[["2007","2008","2009","2010","2011","2012","2013", "2014", "2015", "2016", "2017"]]
geo_group_tech_Canada_sex2.head()

REF_DATE,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
Sex,,,,,,,,,,,
Females,27075.0,26283.0,25758.0,26736.0,26679.0,27705.0,29151.0,30735.0,33615.0,36531.0,41649.0
Males,74310.0,71955.0,69633.0,73290.0,75906.0,78702.0,84552.0,89850.0,96897.0,100917.0,112761.0

In [ ]:
# Plot data into bar graph and label

In [106]:
#by Credential Type
geo_group_tech_Canada_Registration = geo_group_tech_Canada.groupby(["REF_DATE", "Registration status"]).sum().reset_index()
geo_group_tech_Canada_Registration.head()

    REF_DATE Registration status    VALUE
0  1992/1993   Full-time student  77928.0
1  1992/1993   Part-time student  27675.0
2  1993/1994   Full-time student  81222.0
3  1993/1994   Part-time student  25632.0
4  1994/1995   Full-time student  83334.0

In [107]:
#Syntax: DataFrame.pivot(index=None, columns=None, values=None)[source]
# Minor Data Munging to Re-Format the Data Frames
geo_group_tech_Canada_Registration2 = geo_group_tech_Canada_Registration.pivot(index ="Registration status", columns = "REF_DATE", values = "VALUE")
#geo_group_tech_Canada3.reset_index(level = None, inplace = True)
#Update columns and preview the Reformatting worked
geo_group_tech_Canada_Registration2 = geo_group_tech_Canada_Registration2.rename(columns={"1992/1993": "1993", "1993/1994": "1994","1994/1995": "1995", "1995/1996": "1996", "1996/1997": "1997", "1997/1998": "1998", "1998/1999": "1999","1999/2000": "2000", "2000/2001": "2001", "2001/2002": "2002", "2002/2003": "2003", "2003/2004": "2004","2004/2005": "2005","2005/2006": "2006","2006/2007": "2007", "2007/2008": "2008","2008/2009": "2009","2009/2010": "2010", "2010/2011": "2011", "2011/2012": "2012", "2012/2013": "2013", "2013/2014": "2014", "2014/2015": "2015", "2015/2016": "2016", "2016/2017": "2017" })
geo_group_tech_Canada_Registration2 = geo_group_tech_Canada_Registration2[["2007","2008","2009","2010","2011","2012","2013", "2014", "2015", "2016", "2017"]]
geo_group_tech_Canada_Registration2.head()

REF_DATE,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
Registration status,,,,,,,,,,,
Full-time student,81012.0,78039.0,76335.0,79260.0,82554.0,85506.0,90969.0,96009.0,105291.0,113394.0,128073.0
Part-time student,20373.0,20199.0,19056.0,20766.0,20031.0,20901.0,22734.0,24576.0,25221.0,24054.0,26337.0

In [ ]:
# Plot data into bar graph and label